In [1]:
# importaciones
import pandas as pd
import numpy as np

import os
import sys

ruta = r"c:\Users\antonio\Desktop\Proyecto_Final_Data\src"  # Ruta a src
sys.path.append(ruta)  
import sp_limpieza

from sp_limpieza import limpiar_nombres_columnas 
from sp_limpieza import valores_unicos

In [2]:
# carga y lectura de archivos(cities)
ruta = "../data/data_raw/cities.csv"
df_cities_raw = pd.read_csv(ruta)

In [3]:
#creamos copia entes empezar la limpieza y transformacion
df_cities = df_cities_raw.copy()

In [4]:
print(df_cities.shape)  # Devuelve (filas, columnas)
df_cities.info() # Muestra informacion general
df_cities.head() # Muestra las primeras filas

(96, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96 entries, 0 to 95
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CityID     96 non-null     int64
 1   CityName   96 non-null     object
 2   Zipcode    96 non-null     int64
 3   CountryID  96 non-null     int64
dtypes: int64(3), object(1)
memory usage: 3.1+ KB

   CityID        CityName  Zipcode  CountryID
0       1          Dayton    80563         32
1       2         Buffalo    17420         32
2       3         Chicago    44751         32
3       4         Fremont    20641         32
4       5  Virginia Beach    62389         32

In [5]:
# Verificar duplicados en CityID
print("Duplicados en CityID:", df_cities["CityID"].duplicated().sum())
# Verificar duplicados en CityName
print("Duplicados en CityName:", df_cities["CityName"].duplicated().sum())

Duplicados en CityID: 0
Duplicados en CityName: 0

In [6]:
#verificamos que CountryID es siempre el mismo valor y no aporta nada a nuestro df
df_cities["CountryID"].value_counts()

CountryID
32    96
Name: count, dtype: int64

In [7]:
# Eliminamos columna
df_cities = df_cities.drop(columns=["CountryID"])
print(df_cities.head())  # Verificamos que ya no esté

   CityID        CityName  Zipcode
0       1          Dayton    80563
1       2         Buffalo    17420
2       3         Chicago    44751
3       4         Fremont    20641
4       5  Virginia Beach    62389

In [8]:
# El codigo postal esta como int y deberia ser un str (son identificadores, no valores numéricos)
df_cities["Zipcode"] = df_cities["Zipcode"].astype(str)
# Verificar el cambio
print(df_cities.dtypes)

CityID       int64
CityName    object
Zipcode     object
dtype: object

In [9]:
df_cities = limpiar_nombres_columnas(df_cities)
df_cities.head()

   City_Id       City_Name Zipcode
0        1          Dayton   80563
1        2         Buffalo   17420
2        3         Chicago   44751
3        4         Fremont   20641
4        5  Virginia Beach   62389

In [ ]:
valores_unicos(df_cities)

In [11]:
df_cities.describe().T

         count  mean        std  min    25%   50%    75%   max
City_Id   96.0  48.5  27.856777  1.0  24.75  48.5  72.25  96.0

In [12]:
df_cities.to_csv("../data/data_limpios/cities_clean.csv", index=False)